tests/data/get_power.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="urn:Belkin:service:insight:1">
  <s:Body>
    <u:GetInsightParams />
  </s:Body>
</s:Envelope>