bundles/binding/org.openhab.binding.wemo/src/main/java/org/openhab/binding/wemo/internal/GetInsightParams.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:GetInsightParams xmlns:u="urn:Belkin:service:insight:1"></u:GetInsightParams>
  </s:Body>
</s:Envelope>